examples/stacked/airFlow/0/U
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volVectorField;
 location "0";
 object U;
}

dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform (2.0 0 0);

boundaryField
{
  inlet
  {
    type fixedValue;
    value uniform (2.0 0 0);
  }
  outlet
  {
    type zeroGradient;
    inletValue uniform (0.5 0 0);
  }
  symm_plane
  {
    type symmetryPlane;
  }
  top_bottom
  {
    type zeroGradient;
  }
  air_to_solution
  {
    type noSlip;
  }
} 	// ************************************************************************* //

