examples/stacked/airFlow/constant/transportProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object transportProperties;
}

transportModel Newtonian;

nu     [ 0 2 -1 0 0 0 0 ]     1.4029367349128886e-05 ; 	// ************************************************************************* //

