examples/stacked/airFlow/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
	//grad(U)         cellLimited Gauss linear 1;
	//grad(cw)        cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;
    //div(phi,U)      bounded Gauss limitedLinearV 1;
    div(phi,U)      Gauss linearUpwind grad(U);
    //div(phi,h)      bounded Gauss upwind;
    //div(phi,cw)	    bounded Gauss limitedLinear01 1;
    //div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
	div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default        	orthogonal;
}


// ************************************************************************* //
