examples/stacked/airFlow/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/air";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
		preconditioner	DIC;
        //solver          GAMG;
        //smoother        GaussSeidel;
        //nPreSweeps      0;
        //nPostSweeps     2;
        //cacheAgglomeration  on;
        //agglomerator    faceAreaPair;
        //nCellsInCoarsestLevel   500;
        //mergeLevels     1;
        tolerance       5e-7;
        relTol          0.05;
        //minIter         3;
        //maxIter         200;
    }

    U
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-9;
        relTol           0.0;
    }
}

SIMPLE
{
	pRefCell 0;
	pRefValue 0;
	residualControl
	{
		p           1e-6;
		U   	    1e-7;
	}
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    fields
    {
        p       		0.3;
		cw				1;
    }

    equations
    {
        U           	0.7;
        h     			1;
    }
}


// ************************************************************************* //
